taurus.yml
provisioning: "local"

modules:
  jmeter:
    gui: false
    properties:
      global_pause_deviation : 100
      micro_pause_deviation : 100
      short_pause_deviation : 500
      normal_pause_deviation : 5000
      long_pause_deviation : 10000
      longer_pause_deviation : 15000
      server_url : "ifs.local-dev"
      authorisation_url : "auth.local-dev:9443"
      competitions_csv : "jmeter/Representative/competition_data.csv"
      assessor_csv : "jmeter/Representative/assessor_data.csv"
      front_door_competitions_csv : "jmeter/Representative/front-door-competitions.csv"
      summariser.name : summary
      summariser.interval : 5
      summariser.log : true
      summariser.out : true

  cloud:
    test: High load test

execution:
  - scenario: applicant_users
    iterations: 1
    locations:
      eu-west-2: 1
      europe-west2-a: 1
    concurrency: 1

  - scenario: h2020_users
    iterations: 1
    locations:
      eu-west-2: 1
      europe-west2-a: 1
    concurrency: 1

  - scenario: front_door_users
    iterations: 1
    locations:
      eu-west-2: 1
      europe-west2-a: 1
    concurrency: 1
    files:
      - jmeter/Representative/front-door-competitions.csv

  - scenario: competition_management
    iterations: 1
    locations:
      eu-west-2: 1
      europe-west2-a: 1
    concurrency: 1

#  - scenario: assessor_users
#    iterations: 1
#    locations:
#      eu-west-2: 1
#      europe-west2-a: 1
#    concurrency: 1
#    files:
#      - jmeter/Representative/assessor_data.csv

scenarios:
  applicant_users:
    script: taurus/application.jmx
  h2020_users:
    script: taurus/h2020.jmx
  front_door_users:
    script: taurus/front_door.jmx
  competition_management:
    script: taurus/competition_management.jmx
#  assessor_users:
#    script: taurus/assessor.jmx

reporting:
  - module: passfail
    criteria:
      - succ<100%, stop as failed